export default {
  //基本点位配置
  point: [
    {
      id: 1,
      clickType: '22',
      img: 'yingTexture',
      name: '1',
      position: [
        116.400146484375,
        39.918162846609455
      ],
    },
    {
      id: 2,
      clickType: '22',
      img: 'quTexture',
      name: '2',
      position: [
        89.912109375,
        40.713955826286046
      ]
    },
    {
      id: 3,
      clickType: '22',
      img: 'quTexture',
      name: '3',
      position: [
        107.841796875,
        28.304380682962783
      ]
    },
    {
      id: 3,
      clickType: '22',
      img: 'quTexture',
      name: '3',
      position: [
        101.25,
        35.17380831799959
      ]
    },
    {
      id: 3,
      clickType: '22',
      img: 'quTexture',
      name: '3',
      position: [
        107.138671875,
        41.705728515237524
      ]
    },
    {
      id: 3,
      clickType: '22',
      img: 'zpTexture',
      name: '3',
      position: [
        128.232421875,
        45.583289756006316
      ]
    },
    {
      id: 3,
      clickType: '22',
      img: 'zpTexture',
      name: '3',
      position: [
        82.265625,
        39.70718665682654
      ]
    },

    {
      id: 3,
      clickType: '22',
      img: 'zpTexture',
      name: '3',
      position: [
        118.91601562499999,
        45.1510532655634
      ]
    },
    {
      id: 3,
      clickType: '22',
      img: 'zpTexture',
      name: '3',
      position: [
        115.75195312499999,
        28.38173504322308
      ]
    },
  ],
  //线配置  中心店为ying
  quLine: [
    [
      89.912109375,
      40.713955826286046
    ],
    [
      107.841796875,
      28.304380682962783
    ],
    [
      101.25,
      35.17380831799959
    ],
    [
      107.138671875,
      41.705728515237524
    ]

  ],
  //飞线配置 
  flyLine: [
    [
      [118.9160, 45.1511],
      [107.1387, 41.7057]
    ],
    [
      [82.2656, 39.7072],
      [89.9121, 40.7140]
    ],
    [
      [107.8418, 28.3044],
      [	115.7520, 28.3817]
    ],
    [
      [	116.4001, 	39.9182],
      [	128.2324, 	45.5833]
    ]
  ]
}